# Getting Started with pandas

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

## 5.1 Introduction to pandas Data Structures

### Series

In [4]:
obj = pd.Series([4, 7, -5, 3]) # creating from a list with default indexing
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values #attribute1

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index #attribute #2, like range(4)

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) # creating from a list with custom indexing
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['c'] # access by index

3

In [10]:
obj2[['c', 'a', 'd']] # access by list of indexes

c    3
a   -5
d    4
dtype: int64

In [11]:
obj2[obj2 > 0] #boolean mask

d    4
b    7
c    3
dtype: int64

In [12]:
obj2 * 2 #arithmetic operators

d     8
b    14
a   -10
c     6
dtype: int64

In [13]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
#Creating a series from a dict
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states) #automative data alignment
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
#Missing data
pd.isnull(obj4) #function

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4) #function

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj4.isnull() #method

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
# A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
# Both the Series object itself and its index have a name attribute, which integrates with other key areas of pandas functionality
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [23]:
# Changing the index
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [24]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [25]:
# Creating from a dict
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
# Creating from a dict + Arranging columns
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [27]:
# Passing a column that is not in the source dict leads to a column with NaN
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [28]:
frame2.columns #DataFrame attribute

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [29]:
# Retrieving a column
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [30]:
# Retrieving a row
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [31]:
# Modifying columns by assignment
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [32]:
# Modifying columns by assignment (lenght must match)
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [33]:
frame2['latitude'] = 0.0
frame2

       year   state  pop  debt  latitude
one    2000    Ohio  1.5   0.0       0.0
two    2001    Ohio  1.7   1.0       0.0
three  2002    Ohio  3.6   2.0       0.0
four   2001  Nevada  2.4   3.0       0.0
five   2002  Nevada  2.9   4.0       0.0
six    2003  Nevada  3.2   5.0       0.0

In [34]:
# Modifying columns by assignment considering indexes
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt  latitude
one    2000    Ohio  1.5   NaN       0.0
two    2001    Ohio  1.7  -1.2       0.0
three  2002    Ohio  3.6   NaN       0.0
four   2001  Nevada  2.4  -1.5       0.0
five   2002  Nevada  2.9  -1.7       0.0
six    2003  Nevada  3.2   NaN       0.0

In [35]:
# Assigning a column that doesn’t exist
frame2['eastern'] = frame2.state == 'Ohio' # or = 0.
frame2

       year   state  pop  debt  latitude  eastern
one    2000    Ohio  1.5   NaN       0.0     True
two    2001    Ohio  1.7  -1.2       0.0     True
three  2002    Ohio  3.6   NaN       0.0     True
four   2001  Nevada  2.4  -1.5       0.0    False
five   2002  Nevada  2.9  -1.7       0.0    False
six    2003  Nevada  3.2   NaN       0.0    False

In [36]:
# Deleting columns
del frame2['eastern']
frame2

       year   state  pop  debt  latitude
one    2000    Ohio  1.5   NaN       0.0
two    2001    Ohio  1.7  -1.2       0.0
three  2002    Ohio  3.6   NaN       0.0
four   2001  Nevada  2.4  -1.5       0.0
five   2002  Nevada  2.9  -1.7       0.0
six    2003  Nevada  3.2   NaN       0.0

In [37]:
del frame2['latitude']

In [38]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [39]:
# Creating a DataFrame from a nested dict
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [40]:
#Swaping rows and columns
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [41]:
# a DataFrame’s index and columns have their name attributes
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [42]:
frame3.values #returns 2D ndarray if values have the same type

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [43]:
frame2.values # returns lists of vales if they are of different types

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

**Table 5-1. Possible data inputs to DataFrame constructor**

Type | Notes
---|---
2D ndarray |A matrix of data, passing optional row and column labels
dict of arrays, lists, or tuples |Each sequence becomes a column in the DataFrame; all sequences must be the same length
NumPy structured/record array | Treated as the “dict of arrays” case
dict of Series | Each value becomes a column; indexes from each Series are unioned together to form the result’s row index if no explicit index is passed
dict of dicts | Each inner dict becomes a column; keys are unioned to form the row index as in the “dict of Series” case
List of dicts or Series | Each item becomes a row in the DataFrame; union of dict keys or Series indexes become the DataFrame’s column labels
List of lists or tuples | Treated as the “2D ndarray” case
Another DataFrame | The DataFrame’s indexes are used unless different ones are passed
NumPy MaskedArray | Like the “2D ndarray” case except masked values become NA/missing in the DataFrame result

### Index Objects - Immutable

In [44]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [45]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [46]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [47]:
obj2.index is labels

True

In [48]:
# an Index also behaves like a fixed-size set (but can contain duplicates)
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [49]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [50]:
'Ohio' in frame3.columns

True

In [51]:
2003 in frame3.index

False

In [52]:
# Unlike Python sets, a pandas Index can contain duplicate labels
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

**Table 5-2. Some Index methods and properties**

Method | Description
---|---
append |Concatenate with additional Index objects, producing a new Index
difference |Compute set difference as an Index
intersection |Compute set intersection
union |Compute set union
isin| Compute boolean array indicating whether each value is contained in the passed collection
delete |Compute new Index with element at index i deleted
drop |Compute new Index by deleting passed values
insert |Compute new Index by inserting element at index i
is_monotonic |Returns True if each element is greater than or equal to the previous element
is_unique |Returns True if the Index has no duplicate values
unique |Compute the array of unique values in the Index

## 5.2 Essential Functionality

### Reindexing

In [53]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [54]:
# forward-filling missing values
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [55]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [56]:
# The columns can be reindexed with the columns keyword
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [57]:
frame.loc[['a', 'b', 'c', 'd'], states]

c:\users\asus\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

**Table 5-3. reindex function arguments**

Argument | Description
---|---
index | New sequence to use as index. Can be Index instance or any other sequence-like Python data structure. An Index will be used exactly as is without any copying.
method |Interpolation (fill) method; 'ffill' fills forward, while 'bfill' fills backward.
fill_value |Substitute value to use when introducing missing data by reindexing.
limit |When forward- or backfilling, maximum size gap (in number of elements) to fill.
tolerance |When forward- or backfilling, maximum size gap (in absolute numeric distance) to fill for inexact matches.
level| Match simple Index on level of MultiIndex; otherwise select subset of.
copy |If True, always copy underlying data even if new index is equivalent to old index; if False, do not copy the data when the indexes are equivalent.

### Dropping Entries from an Axis

**DataFrame.drop() creates a new object, DataFrame.drop(, inplace=True) doesn't.**

In [58]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [59]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [60]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [61]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [63]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [64]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

In [65]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [66]:
obj[[1,2]]

b    1.0
c    2.0
dtype: float64

In [67]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [68]:
#Slicibg is inclusive:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [69]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [71]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [72]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [73]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [75]:
data[data < 5] = 0

In [76]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

In [77]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [78]:
data.loc['Colorado', ['two', 'three']] # axis labels

two      5
three    6
Name: Colorado, dtype: int32

In [79]:
data.iloc[2, [3, 0, 1]] # integers

four    11
one      8
two      9
Name: Utah, dtype: int32

In [80]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [81]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

**Table 5-4. Indexing options with DataFrame**

Type | Notes
---|---
df[val] |Select single column or sequence of columns from the DataFrame; special case conveniences: boolean array (filter rows), slice (slice rows), or boolean DataFrame (set values based on some criterion)
df.loc[val] |Selects single row or subset of rows from the DataFrame by label
df.loc[:, val] |Selects single column or subset of columns by label
df.loc[val1, val2] |Select both rows and columns by label
df.iloc[where] |Selects single row or subset of rows from the DataFrame by integer position
df.iloc[:, where] |Selects single column or subset of columns by integer position
df.iloc[where_i, where_j] |Select both rows and columns by integer position
df.at[label_i, label_j] |Select a single scalar value by row and column label
df.iat[i, j] |Select a single scalar value by row and column position (integers)
reindex method |Select either rows or columns by labels
get_value, set_value methods |Select single value by row and column label

### Arithmetic and Data Alignment

In [83]:
# Data alignment is possible only for rows and columns that present at the both dataframes, otherwise - NaN
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

### Arithmetic methods with fill values

In arithmetic operations between differently indexed objects, you might want to fill
with a special value, like 0, when an axis label is found in one object but not the other:

In [84]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [85]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [86]:
# Using the add method on df1, I pass df2 and an argument to fill_value:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [87]:
df1.rdiv(1) # = 1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

**Table 5-5. Flexible arithmetic methods**

Method | Description
---|---
add, radd |Methods for addition (+)
sub, rsub |Methods for subtraction (-)
div, rdiv |Methods for division (/)
floordiv, rfloordiv |Methods for floor division (//)
mul, rmul |Methods for multiplication (\*)
pow, rpow |Methods for exponentiation (\**)

### Operations between DataFrame and Series

In [88]:
arr = np.arange(12.).reshape((3, 4))
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [89]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [90]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [91]:
series3 = frame['d']
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

In [94]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.576566 -1.541018 -0.195721
Ohio   -1.095681  1.462085  0.710851
Texas   1.033697  0.609371  1.073939
Oregon -1.700602 -0.449151  1.828007

In [93]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.322503
d    0.354667
e    3.028193
dtype: float64

In [95]:
frame.apply(f, axis='columns')

Utah      2.117584
Ohio      2.557767
Texas     0.464568
Oregon    3.528609
dtype: float64

In [96]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.58  -1.54  -0.20
Ohio    -1.10   1.46   0.71
Texas    1.03   0.61   1.07
Oregon  -1.70  -0.45   1.83

### Sorting and Ranking

In [97]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [98]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [99]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [100]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [101]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [102]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [103]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [104]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [105]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [106]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [107]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [108]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [109]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [110]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],'c': [-2, 5, 8, -2.5]})
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

**Table 5-6. Tie-breaking methods with rank**

Method | Description
---|---
'average' |Default: assign the average rank to each entry in the equal group
'min' | Use the minimum rank for the whole group
'max' | Use the maximum rank for the whole group
'first' | Assign ranks in the order the values appear in the data
'dense' | Like method='min', but ranks always increase by 1 in between groups rather than the number of equal elements in a group

### Axis Indexes with Duplicate Labels

In [111]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj.index.is_unique

False

In [112]:
obj['a']

a    0
a    1
dtype: int64

In [113]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df.loc['b']

          0         1         2
b -1.260989  0.058630 -0.347108
b -0.801893  1.222238  0.128450

## 5.3 Summarizing and Computing Descriptive Statistics

In [114]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [115]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [116]:
df.sum(axis='columns') #or axis=1

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [117]:
df.mean(axis='columns', skipna=False) #skipna=True by default

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [118]:
df.idxmax()

one    b
two    d
dtype: object

In [119]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [120]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [121]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

**Table 5-8. Descriptive and summary statistics**

Method |Description
---|---
count |Number of non-NA values
describe |Compute set of summary statistics for Series or each DataFrame column
min, max |Compute minimum and maximum values
argmin, argmax |Compute index locations (integers) at which minimum or maximum value obtained, respectively
idxmin, idxmax |Compute index labels at which minimum or maximum value obtained, respectively
quantile |Compute sample quantile ranging from 0 to 1
sum |Sum of values
mean |Mean of values
median |Arithmetic median (50% quantile) of values
mad |Mean absolute deviation from mean value
prod |Product of all values
var |Sample variance of values
std |Sample standard deviation of values
skew |Sample skewness (third moment) of values
kurt |Sample kurtosis (fourth moment) of values
cumsum |Cumulative sum of values
cummin, cummax |Cumulative minimum or maximum of values, respectively
cumprod |Cumulative product of values
diff |Compute first arithmetic difference (useful for time series)
pct_change |Compute percent changes

### Correlation and Covariance

In [123]:
import pandas_datareader.data as web

In [124]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [125]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})

In [126]:
volume = pd.DataFrame({ticker: data['Volume']
                       for ticker, data in all_data.items()})

In [128]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-02-28 -0.009836 -0.007473 -0.001248  0.003468
2019-03-01  0.010511  0.007746  0.004463  0.018814
2019-03-04  0.005029 -0.005532 -0.002399  0.005969
2019-03-05 -0.001820 -0.003973 -0.004988  0.012398
2019-03-06 -0.006779  0.000870  0.005372  0.000129

In [129]:
returns['MSFT'].corr(returns['IBM'])

0.486514246100686

In [130]:
returns['MSFT'].cov(returns['IBM'])

8.721724132594946e-05

In [131]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.371769  0.449917  0.457234
IBM   0.371769  1.000000  0.486514  0.407898
MSFT  0.449917  0.486514  1.000000  0.537107
GOOG  0.457234  0.407898  0.537107  1.000000

In [132]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000271  0.000076  0.000107  0.000116
IBM   0.000076  0.000152  0.000087  0.000078
MSFT  0.000107  0.000087  0.000211  0.000120
GOOG  0.000116  0.000078  0.000120  0.000238

In [133]:
returns.corrwith(returns["IBM"])

AAPL    0.371769
IBM     1.000000
MSFT    0.486514
GOOG    0.407898
dtype: float64

In [134]:
returns.corrwith(volume)

AAPL   -0.059730
IBM    -0.153295
MSFT   -0.089546
GOOG   -0.017742
dtype: float64

### Unique Values, Value Counts, and Membership

In [135]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [136]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [137]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [138]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [139]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [140]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int32)

In [141]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

**Table 5-9. Unique, value counts, and set membership methods**

Method |Description
---|---
isin |Compute boolean array indicating whether each Series value is contained in the passed sequence of values
match |Compute integer indices for each value in an array into another array of distinct values; helpful for data alignment and join-type operations
unique |Compute array of unique values in a Series, returned in the order observed
value_counts |Return a Series containing unique values as its index and frequencies as its values, ordered count in descending order